Amiya200/stm32_water_tank/Core/Src/model_handle.c
void ModelHandle_StopRestart(void)
{
    if (!restartActive)
        return;

    restartActive = false;

    stop_motor();

    motorOwner = MOTOR_OWNER_NONE;
}



typedef struct __attribute__((packed))
{
    uint16_t sig;
    uint8_t  gap;
    uint8_t  retry;
    uint16_t uv;
    uint16_t ov;
    uint8_t  maxrun;
    uint16_t over10;
    uint16_t under10;
    uint8_t  crc;
} SystemEEPROMBlock;

#define EE_ADDR_SYS_BLOCK      0x0000
#define SYS_SIG 0x5A5A
//static uint16_t SYS_CRC16(const uint8_t *d, uint16_t l)
//{
//    uint16_t c = 0xFFFF;
//    while (l--) c = (c>>1) ^ (*d++ + 0xA001);
//    return c;
//}
void ModelHandle_SaveSettingsToEEPROM(void)
{
    SystemEEPROMBlock b;
    b.sig   = SYS_SIG;
    b.gap   = sys.gap_time_s;
    b.retry = sys.retry_count;
    b.uv    = sys.uv_limit;
    b.ov    = sys.ov_limit;
    b.maxrun = sys.maxrun_min;
    b.over10  = (uint16_t)(sys.overload * 10.0f);
    b.under10 = (uint16_t)(sys.underload * 10.0f);

    b.crc = 0;
    uint8_t *p = (uint8_t*)&b;
    for(int i=0;i<sizeof(b)-1;i++) b.crc ^= p[i];

    EEPROM_WriteBuffer(EE_ADDR_SYS_BLOCK, (uint8_t*)&b, sizeof(b));
}
void ModelHandle_LoadSettingsFromEEPROM(void)
{
    SystemEEPROMBlock b;
    EEPROM_ReadBuffer(EE_ADDR_SYS_BLOCK, (uint8_t*)&b, sizeof(b));
    uint8_t crc = 0;
    uint8_t *p = (uint8_t*)&b;
    for(int i=0;i<sizeof(b)-1;i++) crc ^= p[i];
    if(b.sig != SYS_SIG || crc != b.crc) return;
    sys.gap_time_s  = b.gap;
    sys.retry_count = b.retry;
    sys.uv_limit    = b.uv;
    sys.ov_limit    = b.ov;
    sys.maxrun_min  = b.maxrun;
    sys.overload    = b.over10 / 10.0f;
    sys.underload   = b.under10 / 10.0f;
}
void ModelHandle_SaveModeState(void)
{
    modeState.manual_on          = manualActive;
    modeState.semi_on            = semiAutoActive;
    modeState.timer_on           = timerActive;
    modeState.countdown_on       = countdownActive;
    modeState.twist_on           = twistActive;
    modeState.auto_on            = autoActive;
    modeState.motor_on           = (motorStatus == 1);
    modeState.power_restore_mode = powerRestoreMode;

    EEPROM_WriteBuffer(0x0200, (uint8_t*)&modeState, sizeof(modeState));
}
static void backup_current_mode(void)
{
    previousOwner     = motorOwner;
    previousManual    = manualActive;
    previousSemi      = semiAutoActive;
    previousCountdown = countdownActive;
    previousAuto      = autoActive;
}
static void restore_previous_mode(void)
{
    if (isTankFull())
    {
        stop_motor();
        return;
    }

    manualActive    = previousManual;
    semiAutoActive  = previousSemi;
    countdownActive = previousCountdown;
    autoActive      = previousAuto;

    if (previousManual)
        motorOwner = MOTOR_OWNER_MANUAL;
    else if (previousSemi)
        motorOwner = MOTOR_OWNER_SEMIAUTO;
    else if (previousCountdown)
        motorOwner = MOTOR_OWNER_COUNTDOWN;
    else if (previousAuto)
        motorOwner = MOTOR_OWNER_AUTO;
    else
    {
        /* No previous mode → do NOT auto restart */
        motorOwner = MOTOR_OWNER_NONE;
        suppressAutoOneCycle = true;
        return;
    }

    if (isAnyModeActive())
        start_motor();
}

void ModelHandle_LoadModeState(void)
{
    EEPROM_ReadBuffer(0x0200, (uint8_t*)&modeState, sizeof(modeState));

    powerRestoreMode = modeState.power_restore_mode;
    if (powerRestoreMode > 2) powerRestoreMode = 0;

    if (powerRestoreMode == 1) /* NO */
    {
        manualActive = semiAutoActive = countdownActive =
        twistActive  = timerActive = autoActive = false;
        return;
    }
    manualActive    = modeState.manual_on;
    semiAutoActive  = modeState.semi_on;
    timerActive     = modeState.timer_on;
    countdownActive = modeState.countdown_on;
    twistActive     = modeState.twist_on;
    autoActive      = modeState.auto_on;
}
void ModelHandle_SaveTimerToEEPROM(void)
{
    TimerEEPROMBlock blk;
    memset(&blk, 0, sizeof(blk));

    blk.signature = TIMER_EE_SIGNATURE;
    blk.version   = TIMER_EE_VERSION;
    memcpy(blk.slots, timerSlots, sizeof(timerSlots));

    blk.crc = Timer_CRC16((uint8_t*)&blk,
                          sizeof(blk) - sizeof(uint16_t));

    EEPROM_WriteBuffer(EE_ADDR_TIMER_BLOCK,
                       (uint8_t*)&blk,
                       sizeof(blk));
}
void ModelHandle_LoadTimerFromEEPROM(void)
{
    TimerEEPROMBlock blk;
    EEPROM_ReadBuffer(EE_ADDR_TIMER_BLOCK,(uint8_t*)&blk,sizeof(blk));

    if(blk.signature != TIMER_EE_SIGNATURE) return;

    uint16_t crc = Timer_CRC16((uint8_t*)&blk, sizeof(blk)-2);
    if(blk.crc != crc) return;     // <<< CRITICAL

    memcpy(timerSlots, blk.slots, sizeof(timerSlots));
}
void Timer_EEPROM_EnsureValid(void)
{
    TimerEEPROMBlock blk;
    EEPROM_ReadBuffer(EE_ADDR_TIMER_BLOCK,(uint8_t*)&blk,sizeof(blk));

    uint16_t crc = Timer_CRC16((uint8_t*)&blk,sizeof(blk)-2);

    if(blk.signature!=TIMER_EE_SIGNATURE || blk.crc!=crc)
    {
        memset(timerSlots,0,sizeof(timerSlots));
        ModelHandle_SaveTimerToEEPROM();
    }
}
static bool isTankFull(void)
{
    static uint32_t stableStart = 0;
    static bool lastState = false;

    bool fullDetected = (adcData.voltages[3] < 0.10f);
    uint32_t now = HAL_GetTick();
    if (fullDetected)
    {
        if (!lastState)
        {
            lastState = true;
            stableStart = now;
        }
        if ((now - stableStart) >= 1000UL)
            return true;
    }
    else
    {
        lastState = false;
    }
    return false;
}

void ModelHandle_TimerRecalculateNow(void)
{
    if (!timerActive) return;
    ModelHandle_ProcessTimerSlots();
}
void ModelHandle_ProcessDryRun(void)
{
    ModelHandle_SoftDryRunHandler();
}
uint16_t ModelHandle_GetGapTime(void)        { return sys.gap_time_s; }
uint8_t  ModelHandle_GetRetryCount(void)     { return sys.retry_count; }
uint16_t ModelHandle_GetUnderVolt(void)      { return sys.uv_limit; }
uint16_t ModelHandle_GetOverVolt(void)       { return sys.ov_limit; }
float    ModelHandle_GetOverloadLimit(void)  { return sys.overload; }
float    ModelHandle_GetUnderloadLimit(void) { return sys.underload; }
uint16_t ModelHandle_GetMaxRunTime(void)     { return sys.maxrun_min; }
uint8_t ModelHandle_GetPowerRestoreMode(void)
{
    return powerRestoreMode;
}
void ModelHandle_SetPowerRestoreMode(uint8_t mode)
{
    if (mode > 2) mode = 0;
    powerRestoreMode = mode;
    ModelHandle_SaveModeState();
}
void ModelHandle_ToggleManual(void)
{
    /* Cancel restart if running */
    if (restartActive)
    {
        restartActive = false;
        motorOwner = MOTOR_OWNER_NONE;
    }

    if (!manualActive)
    {
        clear_all_modes();
        manualActive = true;
        motorOwner = MOTOR_OWNER_MANUAL;
    }
    else
    {
        manualActive = false;
        motorOwner = MOTOR_OWNER_NONE;
        stop_motor();
    }

    ModelHandle_SaveModeState();
}

void ModelHandle_ManualToggleMotor(void)
{
    if (!manualActive)
        return;

    if (Motor_GetStatus())
        stop_motor();
    else
        start_motor();
}


