Amiya200/stm32_water_tank/Core/Src/model_handle.c
void ModelHandle_StopAllModesAndMotor(void)
{
    clear_all_modes();
    stop_motor();
    ModelHandle_SaveModeState();
}
void ModelHandle_FactoryReset(void)
{
    sys.gap_time_s  = 0;
    sys.retry_count = 0;
    sys.uv_limit    = 190;
    sys.ov_limit    = 270;
    sys.overload    = 0.0f;
    sys.underload   = 0.0f;
    sys.maxrun_min  = 300;
    ModelHandle_SaveSettingsToEEPROM();
}
void ModelHandle_StartTimerNearestSlot(void)
{
    ModelHandle_ProcessTimerSlots();
}

static inline void Buzzer_SetPin(bool on)
{
//    HAL_GPIO_WritePin(LED5_GPIO_Port, LED5_Pin,
//                      on ? GPIO_PIN_SET : GPIO_PIN_RESET);
}
static void Buzzer_TriggerAlert(void)
{
    buzzerAlertUntil = HAL_GetTick() + 30000UL;
}
static void Buzzer_Update(void)
{
    uint32_t now = HAL_GetTick();

    static bool buzzerState = false;
    bool newState = false;

    if (now < buzzerAlertUntil)
    {
        if (buzzerContinuous)
        {
            newState = true;   // continuous ON
        }
        else
        {
            newState = ((now % 600UL) < 200UL);  // normal alert beep
        }
    }
    else
    {
        buzzerContinuous = false;
        newState = false;
    }

    if (newState != buzzerState)
    {
        buzzerState = newState;
        Buzzer_SetPin(buzzerState);
    }
}

static inline uint32_t now_ms(void)
{
    return HAL_GetTick();
}
static inline void clear_all_modes(void)
{
    manualActive    = false;
    semiAutoActive  = false;
    countdownActive = false;
    twistActive     = false;
    timerActive     = false;
    autoActive      = false;
    manualOverride  = false;
    countdownMode   = false;
}
static uint32_t motorOnStartMs = 0;
static uint32_t powerOnMs     = 0;

void ModelHandle_OnPowerUp(void)
{
    powerOnMs = HAL_GetTick();
    bootBlockUntil = powerOnMs + 5000UL;  // 5 sec block
}

static inline bool Motor_IsRelayOn(void)
{
    return HAL_GPIO_ReadPin(Relay1_GPIO_Port, Relay1_Pin) == GPIO_PIN_SET;
}
static bool Motor_StartAllowed(void)
{
    return true;   // TEMP: allow immediate start
}

bool ModelHandle_IsRestartActive(void)
{
    return restartActive;
}

static inline void motor_apply(bool on)
{
	if (timerActive && timerState == TIMER_STATE_OFF)
	        on = false;
    bool relayNow = Motor_IsRelayOn();
    if (on)
    {
        if (!Motor_StartAllowed())
            return;

        if (!relayNow)
        {
            Relay_Set(1, true);
            motorOnStartMs = HAL_GetTick();
        }
        motorStatus = 1;
    }
    else
    {
        if (relayNow)
            Relay_Set(1, false);
        motorStatus = 0;
    }

    UART_SendStatusPacket();
}
bool Motor_GetStatus(void)
{
    return Motor_IsRelayOn();
}
static inline void start_motor(void)
{
	if (!restartActive &&
	    timerActive &&
	    timerState == TIMER_STATE_OFF)
	    return;
    if (motorOwner == MOTOR_OWNER_NONE)
        return;

    motor_apply(true);
}

static inline void stop_motor(void)
{
    motor_apply(false);
}
static void check_max_run(void)
{
    if (sys.maxrun_min == 0 || !Motor_GetStatus())
        return;

    if (countdownActive)
        return;
    if (restartActive)
        ;  // allow maxrun protection to work

    uint32_t limit = (uint32_t)sys.maxrun_min * 60000UL;
    if ((HAL_GetTick() - motorOnStartMs) >= limit)
    {
        senseMaxRunReached = true;
        clear_all_modes();
        stop_motor();
        ModelHandle_SaveModeState();
        Buzzer_TriggerAlert();
    }
}
void ModelHandle_CheckDryRun(void)
{
    if (manualActive || semiAutoActive || countdownActive)
    {
        senseDryRun = false;
        return;
    }
    float v = adcData.voltages[5];
    if (v < 0.01f)
        senseDryRun = true;
    else
        senseDryRun = false;
}
void ModelHandle_CheckGroundWater(void)
{
    float v = adcData.voltages[4];
    if (v < 0.01f)
        groundWater = true;
    else
        groundWater = false;
}
static inline bool isAnyModeActive(void)
{
    return (manualActive || semiAutoActive || countdownActive ||
            twistActive || timerActive || autoActive);
}
void ModelHandle_SoftDryRunHandler(void)
{
    if (manualActive)
        return;

    if (autoActive || timerActive)
        return;
    if (motorOwner != MOTOR_OWNER_NONE &&
        motorOwner != MOTOR_OWNER_AUTO &&
        motorOwner != MOTOR_OWNER_RESTART)
        return;

    uint32_t now = now_ms();

    uint16_t gap_s = sys.gap_time_s;
    if (gap_s == 0)
        return;

    ModelHandle_CheckDryRun();

    dryOffGapMs = (uint32_t)gap_s * 1000UL;

    if (!isAnyModeActive())
    {
        stop_motor();
        dryState = DRY_IDLE;
        return;
    }

    switch (dryState)
    {
        case DRY_IDLE:
            if (!senseDryRun)
            {
                start_motor();
                dryState = DRY_NORMAL;
            }
            else if (now >= dryDeadline)
            {
                start_motor();
                dryState = DRY_PROBE;
                dryDeadline = now + DRY_PROBE_ON_MS;
            }
            break;

        case DRY_PROBE:
            if (!senseDryRun)
            {
                dryState = DRY_NORMAL;
            }
            else if (now >= dryDeadline)
            {
                stop_motor();
                dryState = DRY_IDLE;
                dryDeadline = now + dryOffGapMs;
                Buzzer_TriggerAlert();
            }
            break;

        case DRY_NORMAL:
            if (senseDryRun)
            {
                if (!dryConfirming)
                {
                    dryConfirming = true;
                    dryConfirmStart = now;
                }
                else if ((now - dryConfirmStart) >= DRY_CONFIRM_MS)
                {
                    stop_motor();
                    dryState = DRY_IDLE;
                    dryConfirming = false;
                    dryDeadline = now + dryOffGapMs;
                    Buzzer_TriggerAlert();
                }
            }
            else
            {
                dryConfirming = false;
            }
            break;
    }
}

static inline uint32_t get_load_lock_duration_ms(void)
{
    if (sys.retry_count == 0)
        return LOAD_LOCK_DEFAULT_MS;
    return (uint32_t)sys.retry_count * 60000UL;
}

void ModelHandle_CheckLoadFault(void)
{
    /* Only check when motor is actually running */
    if (!Motor_GetStatus())
        return;

