Amiya200/stm32_water_tank/Core/Src/model_handle.c
static uint8_t get_tank_level_percent(void)
{
    if (adcData.voltages[3] < 0.10f)   // 100% probe
        return 100;

    if (adcData.voltages[2] < 0.10f)   // 75% probe
        return 75;

    if (adcData.voltages[1] < 0.10f)   // 50% probe
        return 50;

    if (adcData.voltages[0] < 0.10f)   // 25% probe
        return 25;

    return 0;
}

void ModelHandle_StartTimer(void)
{
    ModelHandle_SaveTimerToEEPROM();
}

void ModelHandle_StopTimer(void)
{
    timerActive = false;
    timerStateDeadline = 0;   // ADD THIS
    stop_motor();
    ModelHandle_SaveModeState();
}

void ModelHandle_CheckAutoTimerActivation(void)
{
    if (timerActive) return;

    if (timer_any_active_slot())
    {
        timerActive = true;
        start_motor();
    }
}
void ModelHandle_StartSemiAuto(void)
{
    clear_all_modes();
    semiAutoActive = true;
    motorOwner     = MOTOR_OWNER_SEMIAUTO;

    start_motor();
    ModelHandle_SaveModeState();
}

void ModelHandle_StopSemiAuto(void)
{
    semiAutoActive = false;
    stop_motor();
    ModelHandle_SaveModeState();
}
static bool autoStartedByUART = false;
void ModelHandle_StartAuto(uint16_t gap_s,
                           uint16_t maxrun_min,
                           uint16_t retry)
{
    if (autoActive) return;   // prevent retrigger

    autoStartedByUART = true;   // <---- IMPORTANT

    clear_all_modes();
    autoActive       = true;
    auto_gap_s       = gap_s;
    auto_maxrun_min  = maxrun_min;
    auto_retry_limit = retry;
    auto_retry_count = 0;
    autoState        = AUTO_ON_WAIT;

    ModelHandle_SaveModeState();
    request_mode_switch(MOTOR_OWNER_AUTO);

    autoDeadline = now_ms() + gap_s * 1000UL;
}

void ModelHandle_StopAuto(void)
{
    autoStartedByUART = false;   // <---- IMPORTANT

    stop_motor();
    autoActive = false;
    autoState  = AUTO_IDLE;
    auto_retry_count = 0;

    EEPROM_WriteBuffer(EE_ADDR_AUTO_RUNTIME,
                       (uint8_t[]){0},
                       sizeof(AutoRuntimeBlock));

    ModelHandle_SaveModeState();
}


void ModelHandle_LoadAutoSettings(void)
{
    EEPROM_ReadBuffer(0x0300, (uint8_t*)&auto_gap_s, sizeof(auto_gap_s));
    EEPROM_ReadBuffer(0x0302, (uint8_t*)&auto_maxrun_min, sizeof(auto_maxrun_min));
    EEPROM_ReadBuffer(0x0304, (uint8_t*)&auto_retry_limit, sizeof(auto_retry_limit));
    AutoRuntimeBlock b;
    EEPROM_ReadBuffer(EE_ADDR_AUTO_RUNTIME,(uint8_t*)&b,sizeof(b));
    if(b.sig != AUTO_SIG) return;
    if(AUTO_CRC((uint8_t*)&b,sizeof(b)-1) != b.crc) return;
    if(!b.active) return;
    autoActive       = true;
    autoState        = (AutoState)b.state;
    auto_retry_count = b.retryCount;
    autoDeadline     = now_ms() + b.remaining_ms;
    autoResumeBoot   = true;
    motorOwner = MOTOR_OWNER_AUTO;

}
static void auto_mode_background_control(void)
{
    uint32_t now = HAL_GetTick();

    /* ===== BLOCK AUTO DURING BOOT ===== */
    if (now < bootBlockUntil)
        return;

    /* ===== NEVER AUTO START IF POWER RESTORE MODE = LAST ===== */
    if (powerRestoreMode == 2)
        return;

    static bool autoWasStartedByLevel = false;

    uint8_t level = get_tank_level_percent();

    /* If any controlled mode active → do not auto */
    if (manualActive || semiAutoActive ||
        timerActive || countdownActive ||
        twistActive)
    {
        autoWasStartedByLevel = false;
        return;
    }

    /* ===== AUTO START CONDITION ===== */
    if (!autoActive && level <= AUTO_START_LEVEL_PERCENT)
    {
        ModelHandle_StartAuto(auto_gap_s,
                              auto_maxrun_min,
                              auto_retry_limit);
        autoWasStartedByLevel = true;
    }

    /* ===== AUTO STOP CONDITION ===== */
    if (autoActive &&
        autoWasStartedByLevel &&
        level >= AUTO_STOP_LEVEL_PERCENT)
    {
        ModelHandle_StopAuto();
        autoWasStartedByLevel = false;
    }
}

static uint32_t autoRunStartMs = 0;

static void auto_tick(void)
{
    if (!autoActive)
        return;

    uint32_t now = now_ms();
    uint8_t level = get_tank_level_percent();

    ModelHandle_CheckGroundWater();
    ModelHandle_CheckDryRun();

    bool protectionFault =
        senseOverLoad ||
        senseUnderLoad ||
        senseOverUnderVolt ||
        senseMaxRunReached;

    /* ========== HARD STOP CONDITIONS ========== */
    if (isTankFull() || protectionFault)
    {
        stop_motor();
        autoActive = false;
        autoState  = AUTO_IDLE;
        auto_retry_count = 0;
        Buzzer_TriggerAlert();
        return;
    }

    /* ========== RETRY LIMIT ENFORCEMENT ========== */
    if (auto_retry_limit > 0 &&
        auto_retry_count >= auto_retry_limit)
    {
        stop_motor();
        autoActive = false;
        autoState  = AUTO_IDLE;
        Buzzer_TriggerAlert();
        return;
    }

    /* ========== SCHEDULE OFF BLOCK ========== */
    if (timerActive && !timer_any_active_slot())
    {
        stop_motor();
        return;
    }

    switch (autoState)
    {
        case AUTO_IDLE:
        {
            bool levelLow = (level <= AUTO_START_LEVEL_PERCENT);

            if (restartActive ||
               (levelLow && groundWater))
            {
                motorOwner = MOTOR_OWNER_AUTO;
                start_motor();

                autoRunStartMs = now;
                autoDeadline = now + ((uint32_t)auto_gap_s * 1000UL);
                autoState = AUTO_ON_WAIT;
            }
        }
        break;

        case AUTO_ON_WAIT:
        {
            /* AUTO MAX RUN LIMIT */
            if (auto_maxrun_min > 0)
            {
                uint32_t maxRunMs =
                    (uint32_t)auto_maxrun_min * 60000UL;

                if ((now - autoRunStartMs) >= maxRunMs)
                {
                    stop_motor();
                    autoActive = false;
                    autoState = AUTO_IDLE;
                    Buzzer_TriggerAlert();
                    return;
                }
            }

            bool faultCondition =
                (!groundWater || senseDryRun);

            if ((int32_t)(now - autoDeadline) >= 0)
            {
                if (faultCondition)
                {
                    stop_motor();
                    auto_retry_count++;

                    autoDeadline =
                        now + ((uint32_t)auto_gap_s * 1000UL);

                    autoState = AUTO_OFF_WAIT;
                }
                else
                {
                    /* Continue next ON cycle */
                    autoDeadline =
                        now + ((uint32_t)auto_gap_s * 1000UL);
                }
            }
        }
        break;

        case AUTO_OFF_WAIT:
        {
            if ((int32_t)(now - autoDeadline) >= 0)
            {
                bool levelLow =
                    (level <= AUTO_START_LEVEL_PERCENT);

                if (restartActive ||
                   (levelLow && groundWater))
                {
                    motorOwner = MOTOR_OWNER_AUTO;
                    start_motor();

                    autoRunStartMs = now;
                    autoDeadline =
                        now + ((uint32_t)auto_gap_s * 1000UL);

                    autoState = AUTO_ON_WAIT;
                }
            }
        }
        break;

        default:
            autoState = AUTO_IDLE;
        break;
    }
}

void ModelHandle_StartCountdown(uint32_t seconds)
{
    if (seconds == 0)
        return;

    clear_all_modes();

    countdownActive   = true;
    countdownMode     = true;
    countdownDuration = seconds;
    cd_deadline       = now_ms() + seconds * 1000UL;

    motorOwner = MOTOR_OWNER_COUNTDOWN;
    start_motor();

    ModelHandle_SaveModeState();
}

void ModelHandle_StopCountdown(void)
{
    countdownActive = false;
    countdownMode   = false;
    countdownDuration = 0;
    SaveCountdown();
    stop_motor();
    ModelHandle_SaveModeState();
}
static void countdown_tick(void)
{
    if (!countdownActive)
        return;

    uint32_t now = now_ms();

    /* ================= SAFETY STOP ================= */
    if (isTankFull() ||
        senseOverLoad ||
        senseUnderLoad ||
        senseOverUnderVolt ||
        senseMaxRunReached)
    {
        ModelHandle_StopCountdown();
        Buzzer_TriggerAlert();
        return;
    }

    /* ================= TIME EXPIRED ================= */
    if (now >= cd_deadline)
    {
        ModelHandle_StopCountdown();
        return;
    }

    /* ================= UPDATE REMAINING TIME ================= */
    uint32_t remainingMs = cd_deadline - now;
    countdownDuration = remainingMs / 1000UL;

    /* ================= PERIODIC EEPROM SAVE ================= */
    static uint32_t lastSaveMs = 0;

