Amiya200/stm32_water_tank/Core/Src/model_handle.c
    /* Save every 2 seconds to protect EEPROM life */
    if ((now - lastSaveMs) >= 2000UL)
    {
        SaveCountdown();
        lastSaveMs = now;
    }
}

static uint16_t CD_CRC(const uint8_t* d,uint16_t l){
    uint16_t c=0xFFFF;
    while(l--) c=(c>>1)^(*d++ + 0xA001);
    return c;
}
static void SaveCountdown(void)
{
    CountdownBlock b;
    memset(&b, 0, sizeof(b));

    b.sig = CD_SIGNATURE;
    b.active = countdownActive;

    if (countdownActive)
    {
        uint32_t now = now_ms();

        if (cd_deadline > now)
            b.remaining = (cd_deadline - now) / 1000UL;
        else
            b.remaining = 0;
    }
    else
    {
        b.remaining = 0;
    }

    b.crc = CD_CRC((uint8_t*)&b, sizeof(b)-2);

    EEPROM_WriteBuffer(EE_ADDR_COUNTDOWN_BLOCK,
                       (uint8_t*)&b,
                       sizeof(b));
}

void ModelHandle_LoadCountdown(void)
{
    CountdownBlock b;
    EEPROM_ReadBuffer(EE_ADDR_COUNTDOWN_BLOCK,
                      (uint8_t*)&b, sizeof(b));

    if (b.sig != CD_SIGNATURE)
        return;

    if (CD_CRC((uint8_t*)&b, sizeof(b)-2) != b.crc)
        return;

    if (b.active && b.remaining > 0)
    {
        countdownActive   = true;
        countdownMode     = true;
        countdownDuration = b.remaining;

        cd_deadline = now_ms() +
                      b.remaining * 1000UL;

        motorOwner = MOTOR_OWNER_COUNTDOWN;

        /* DO NOT start motor here */
        /* Let Process() handle safe start */
    }
}

void ModelHandle_StartTwist(uint16_t on_s, uint16_t off_s,
                            uint8_t onH, uint8_t onM,
                            uint8_t offH, uint8_t offM)
{
    clear_all_modes();
    uint32_t on_sec  = (on_s  ? on_s  : 1) * 60UL;
    uint32_t off_sec = (off_s ? off_s : 1) * 60UL;
    twistSettings.onDurationSeconds  = on_sec;
    twistSettings.offDurationSeconds = off_sec;
    twistSettings.onHour = onH;
    twistSettings.onMinute = onM;
    twistSettings.offHour = offH;
    twistSettings.offMinute = offM;
    twistSettings.twistArmed = true;
    twistSettings.twistActive = false;
    twist_on_phase = true;
    twist_deadline = now_ms() + on_sec * 1000UL;
    start_motor();
}
void ModelHandle_StopTwist(void)
{
    twistActive = false;
    twistSettings.twistActive = false;
    stop_motor();
    ModelHandle_SaveModeState();
}
static void twist_time_logic(void)
{
    if (!twistSettings.twistArmed) return;
    if (!twistActive &&
        time.hour == twistSettings.onHour &&
        time.min  == twistSettings.onMinute)
    {
        twistActive = true;
        twistSettings.twistActive = true;
        twist_on_phase = true;
        twist_deadline = now_ms() +
                         twistSettings.onDurationSeconds * 1000UL;
        start_motor();
    }
    if (twistActive &&
        time.hour == twistSettings.offHour &&
        time.min  == twistSettings.offMinute)
    {
        ModelHandle_StopTwist();
    }
}
static void twist_tick(void)
{
	if (!twistActive) return;
	    if (isTankFull())
	    {
	        ModelHandle_StopTwist();
	        Buzzer_TriggerAlert();
	        return;
	    }
    uint32_t now = now_ms();
    if (now >= twist_deadline)
    {
        twist_on_phase = !twist_on_phase;
        twist_deadline = now +
            (twist_on_phase ? twistSettings.onDurationSeconds
                            : twistSettings.offDurationSeconds) * 1000UL;
    }
    if (twist_on_phase) start_motor();
    else stop_motor();
}
static void leds_from_model(void)
{
    LED_ClearAllIntents();
    bool motorOn = Motor_GetStatus();
    if (motorOn)
        LED_SetIntent(LED_COLOR_GREEN, LED_MODE_STEADY, 0);
    if (!senseDryRun)
    {
        if (motorOn)
            LED_SetIntent(LED_COLOR_GREEN, LED_MODE_BLINK, 350);
        else
            LED_SetIntent(LED_COLOR_RED, LED_MODE_STEADY, 0);
    }
    if (senseMaxRunReached)
        LED_SetIntent(LED_COLOR_RED, LED_MODE_BLINK, 300);
    if (senseOverLoad || senseUnderLoad)
        LED_SetIntent(LED_COLOR_BLUE, LED_MODE_BLINK, 350);
    if (senseOverUnderVolt)
        LED_SetIntent(LED_COLOR_PURPLE, LED_MODE_BLINK, 350);
    LED_ApplyIntents();
}
void ModelHandle_Process(void)
{
    uint32_t now = HAL_GetTick();

    if (modeSwitchPending)
    {
        if (now >= modeSwitchTime)
        {
            modeSwitchPending = false;
            motorOwner = pendingOwner;
            start_motor();
        }
        return;
    }

    ModelHandle_CheckGroundWater();
    ModelHandle_CheckDryRun();
    ModelHandle_CheckLoadFault();
    check_max_run();

    bool protectionFault =
        senseOverLoad ||
        senseUnderLoad ||
        senseOverUnderVolt ||
        senseMaxRunReached;

    /* ================= RESTART ================= */
    if (restartActive)
    {
        motorOwner = MOTOR_OWNER_RESTART;

        if (isTankFull() || protectionFault || senseDryRun)
        {
            ModelHandle_StopRestart();
            Buzzer_TriggerAlert();
        }
        else
        {
            start_motor();
        }

        leds_from_model();
        Buzzer_Update();
        return;
    }

    /* ================= MANUAL ================= */
    if (manualActive)
    {
        motorOwner = MOTOR_OWNER_MANUAL;

        if (protectionFault)
        {
            stop_motor();
            Buzzer_TriggerAlert();
        }
        else
        {
            start_motor();   // <<< ENSURE RUN
        }

        leds_from_model();
        Buzzer_Update();
        return;
    }

    /* ================= SEMI AUTO ================= */
    if (semiAutoActive)
    {
        motorOwner = MOTOR_OWNER_SEMIAUTO;

        if (isTankFull() || protectionFault || senseDryRun)
        {
            stop_motor();
            Buzzer_TriggerAlert();
        }
        else
        {
            start_motor();   // <<< ENSURE RUN
        }

        leds_from_model();
        Buzzer_Update();
        return;
    }

    /* ================= TIMER ================= */
    if (timerActive)
    {
        ModelHandle_ProcessTimerSlots();
        leds_from_model();
        Buzzer_Update();
        return;
    }

